AccumulationRegisters/СведенияОНеоблагаемыхДоходахФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>СведенияОНеоблагаемыхДоходахФизическихЛиц</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеоблагаемыйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНалогаВзносаОтчисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоходНеПодлежащийНалогообложению</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДивидендов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыВыплатБывшимСотрудникам</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихДоходовФизическихЛиц</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДанныеМежрасчетногоПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>Начисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботыПоВидамВремени</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботыПоВидамВремени.Resource.ОсновноеЗначение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботыПоВидамВремени.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Начисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатВТомЧислеЗаСчетФБ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РанееНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатФСС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВЧасах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВЦеломЗаПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыНорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксСтрока</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксРасчетВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксСторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетнаяБазаЗаЕдиницуНормыВремени</Name>
					<Comment>Расчетная база на единицу нормы времени для расчета сторно-записей</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрацииВремени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрацииНормыВремени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляРезультата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеНачисления</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Comment>Документ, который зарегистрировал сторнируемое начисление</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СторнируемыйДокумент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийГрафик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перерасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьПоРазовымНачислениямДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистраторРазовогоНачисления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РегистраторРазовогоНачисления</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СторнируемыйДокумент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СторноТекущегоПериода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументИсправляемыйВТекущемПериоде</v8:TypeSet>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияПоказателейНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПоказателейНачислений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РегистраторИзмерение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СторнированиеНачислений</v8:Type>
						<v8:Type>cfg:DocumentRef.ПростойСотрудников</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускБезСохраненияОплатыСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.Отпуск</v8:Type>
						<v8:Type>cfg:DocumentRef.БольничныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
						<v8:Type>cfg:DocumentRef.Премия</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтгулСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаДнейУходаЗаДетьмиИнвалидами</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.РазовоеНачисление</v8:Type>
						<v8:Type>cfg:DocumentRef.Увольнение</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускБезСохраненияОплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрогулНеявка</v8:Type>
						<v8:Type>cfg:DocumentRef.ДоходВНатуральнойФорме</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрогулНеявкаСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.Командировка</v8:Type>
						<v8:Type>cfg:DocumentRef.УвольнениеСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.МатериальнаяПомощь</v8:Type>
						<v8:Type>cfg:DocumentRef.Отгул</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускПоУходуЗаРебенком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереносДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыНалогообложенияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыНалогообложенияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяЦеликом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагаетсяЦеликом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагаетсяЧастично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЗарплатаКадрыРасширенныйРК/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ДатыЗапретаИзмененияДанных

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	// Раздел НалогиВзносыОтчисления
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.СведенияОНеоблагаемыхДоходахФизическихЛиц",			"ПериодРегистрации", 	"НДФЛ", "Организация");
	
	// ВнешниеХозяйственныеОперации.НалогиВзносыОтчисленияВХО
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.НалогиВзносыОтчисленияВХО") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("УчетНалоговВзносовОтчисленийВХО");
		Модуль.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных);
	КонецЕсли;
	// Конец ВнешниеХозяйственныеОперации.НалогиВзносыОтчисленияВХО
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьДанныеПерерасчетаОтОбратного(ДанныеПерерасчета, Организация, МесяцНачисления, Сотрудники, ИсключаемыйРегистратор, ЕстьНачисленияПерерасчетОтОбратного) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ОграничениеКорректировкиДохода25МРП = 25 * ЗарплатаКадрыПовтИсп.МесячныйРасчетныйПоказатель(НачалоГода(МесяцНачисления));

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	Запрос.УстановитьПараметр("ОграничениеКорректировкиДохода25МРП", ОграничениеКорректировкиДохода25МРП);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);

	Если Сотрудники <> Неопределено Тогда
		
		Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
		
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|	Начисления.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	РегистрРасчета.Начисления КАК Начисления
		|ГДЕ
		|	Начисления.Организация = &Организация
		|	И Начисления.Регистратор <> &ИсключаемыйРегистратор
		|	И Начисления.ПериодДействия = &МесяцНачисления
		|	И Начисления.ВидРасчета.ОтОбратного " + ?(Сотрудники <> Неопределено, "И Начисления.Сотрудник В (&Сотрудники)", "") + "
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.Сотрудник,
		|	Начисления.ПериодДействияНачало
		|ИМЕЮЩИЕ
		|	СУММА(Начисления.Результат) <= &ОграничениеКорректировкиДохода25МРП
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сотрудники.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТСписокСотрудников
		|ИЗ
		|	ВТСотрудники КАК Сотрудники
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		// необходимо определить размер МРП на начало финансового года
		|	НАЧАЛОПЕРИОДА(ВТСотрудники.ПериодДействияНачало, ГОД) КАК Период
		|ПОМЕСТИТЬ ВТДатыПоМесяцам
		|ИЗ
		|	ВТСотрудники КАК ВТСотрудники";
		
	Запрос.Выполнить();

	Описатель = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудники", "Сотрудник, ПериодДействияНачало");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(Описатель, Истина, "Подразделение, ВидЗанятости, Должность, ДолжностьПоШтатномуРасписанию");
	
	УчетНалоговВзносовОтчислений.СоздатьВТРазмерыМРППоПериодам(МенеджерВременныхТаблиц);

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.ПериодРегистрации КАК ПериодРегистрации,
		|	Начисления.Регистратор КАК Регистратор,
		|	Начисления.НомерСтроки КАК НомерСтроки,
		|	Начисления.ВидРасчета КАК ВидРасчета,
		|	Начисления.ПериодДействия КАК ПериодДействия,
		|	Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|	Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|	Начисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
		|	Начисления.БазовыйПериодКонец КАК БазовыйПериодКонец,
		|	Начисления.Активность КАК Активность,
		|	МАКСИМУМ(Начисления.Сторно) КАК Сторно,
		|	Начисления.Сотрудник КАК Сотрудник,
		|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Начисления.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Начисления.СторноТекущегоПериода КАК СторноТекущегоПериода,
		|	Начисления.Результат КАК Результат,
		|	Начисления.ОтработаноДней КАК ОтработаноДней,
		|	Начисления.ОтработаноЧасов КАК ОтработаноЧасов,
		|	Начисления.РезультатВТомЧислеЗаСчетФБ КАК РезультатВТомЧислеЗаСчетФБ,
		|	Начисления.ГрафикРаботы КАК ГрафикРаботы,
		|	Начисления.ВидУчетаВремени КАК ВидУчетаВремени,
		|	Начисления.ВремяВЧасах КАК ВремяВЧасах,
		|	Начисления.ГрафикРаботыНорма КАК ГрафикРаботыНорма,
		|	Начисления.Организация КАК Организация,
		|	Начисления.ФиксСтрока КАК ФиксСтрока,
		|	Начисления.ФиксЗаполнение КАК ФиксЗаполнение,
		|	Начисления.ФиксРасчетВремени КАК ФиксРасчетВремени,
		|	Начисления.ФиксРасчет КАК ФиксРасчет,
		|	Начисления.ФиксСторно КАК ФиксСторно,
		|	Начисления.РасчетнаяБазаЗаЕдиницуНормыВремени КАК РасчетнаяБазаЗаЕдиницуНормыВремени,
		|	Начисления.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	Начисления.ПериодРегистрацииВремени КАК ПериодРегистрацииВремени,
		|	Начисления.ПериодРегистрацииНормыВремени КАК ПериодРегистрацииНормыВремени,
		|	Начисления.ДоляРезультата КАК ДоляРезультата,
		|	Начисления.Месяц КАК Месяц,
		|	Начисления.ДокументОснование КАК ДокументОснование,
		|	Начисления.СторнируемыйДокумент КАК СторнируемыйДокумент,
		|	Начисления.ГоловнойСотрудник КАК ГоловнойСотрудник,
		|	Начисления.ОбщийГрафик КАК ОбщийГрафик
		|ПОМЕСТИТЬ ВТ_РасчетОтОбратногоМенее25МРП
		|ИЗ
		|	РегистрРасчета.Начисления КАК Начисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокСотрудников КАК СписокСотрудников
		|		ПО СписокСотрудников.Сотрудник = Начисления.Сотрудник
		// отрежем документы межрасчета с доходом больше 25 МРП (для таких сотрудников корректировка в месяце применяться не будет) 
		// межрасчетные выплаты также учитываем (расчет налогов и расчет сумм "от обратного" это разные области)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРазмерыМРППоПериодам КАК МесячныйРасчетныйПоказатель
		|		ПО (НАЧАЛОПЕРИОДА(Начисления.ПериодДействия, ГОД) = МесячныйРасчетныйПоказатель.МесяцНалоговогоПериода)
		|			И Начисления.Результат <= ЕСТЬNULL(МесячныйРасчетныйПоказатель.РазмерМРПНаНачалоГода * 25, -1)
		// отрежем (условие ГДЕ) заполнение начислений, по которым уже были сторнирования в текущем месяце в ранее созданных документах НачислениеЗарплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплаты.НачисленияПерерасчет КАК НачисленияПерерасчет
		|		ПО НачисленияПерерасчет.Ссылка <> &ИсключаемыйРегистратор 
		|			И ТИПЗНАЧЕНИЯ(НачисленияПерерасчет.Ссылка) = ТИП(Документ.НачислениеЗарплаты) 
		|			И НачисленияПерерасчет.ПериодДействия = &МесяцНачисления
		|			И НачисленияПерерасчет.Сотрудник = Начисления.Сотрудник
		|           И НачисленияПерерасчет.Начисление = Начисления.ВидРасчета 
		|           И НачисленияПерерасчет.Сторно
		|ГДЕ
		|	Начисления.Организация = &Организация
		|	И Начисления.Регистратор <> &ИсключаемыйРегистратор
		// документы окончательного расчета
		|	И ТИПЗНАЧЕНИЯ(Начисления.Регистратор) <> ТИП(Документ.НачислениеЗарплаты)
		|	И ТИПЗНАЧЕНИЯ(Начисления.Регистратор) <> ТИП(Документ.Увольнение)
		|	И ТИПЗНАЧЕНИЯ(Начисления.Регистратор) <> ТИП(Документ.УвольнениеСписком)
		|	И Начисления.ПериодДействия = &МесяцНачисления
		|	И Начисления.ВидРасчета.ОтОбратного
		|	И НачисленияПерерасчет.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.ФиксРасчет,
		|	Начисления.ВидРасчета,
		|	Начисления.Месяц,
		|	Начисления.БазовыйПериодНачало,
		|	Начисления.ФиксЗаполнение,
		|	Начисления.ФиксСторно,
		|	Начисления.ПериодРегистрацииНормыВремени,
		|	Начисления.СторнируемыйДокумент,
		|	Начисления.ПериодРегистрации,
		|	Начисления.ПериодРегистрацииВремени,
		|	Начисления.ФиксРасчетВремени,
		|	Начисления.ДокументОснование,
		|	Начисления.ПериодДействияКонец,
		|	Начисления.СторноТекущегоПериода,
		|	Начисления.ГоловнойСотрудник,
		|	Начисления.БазовыйПериодКонец,
		|	Начисления.Организация,
		|	Начисления.ОбщийГрафик,
		|	Начисления.ПериодДействия,
		|	Начисления.ПериодДействияНачало,
		|	Начисления.Регистратор,
		|	Начисления.ГрафикРаботыНорма,
		|	Начисления.ГоловнаяОрганизация,
		|	Начисления.ВидУчетаВремени,
		|	Начисления.ФизическоеЛицо,
		|	Начисления.ГрафикРаботы,
		|	Начисления.ВремяВЧасах,
		|	Начисления.Сотрудник,
		|	Начисления.ФиксСтрока,
		|	Начисления.Активность,
		|	Начисления.НомерСтроки,
		|	Начисления.Результат,
		|	Начисления.ОтработаноДней,
		|	Начисления.ОтработаноЧасов,
		|	Начисления.РезультатВТомЧислеЗаСчетФБ,
		|	Начисления.РасчетнаяБазаЗаЕдиницуНормыВремени,
		|	Начисления.ИдентификаторСтроки,
		|	Начисления.ДоляРезультата
		|
		// выберем строки, по которым вообще не было исправление МАКСИМУМ(Начисления.Сторно) при наличии ЛОЖЬ и ИСТИНА будет получена ИСТИНА
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(Начисления.Сторно) = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Регистратор КАК СторнируемыйДокумент,
		|	ВТ_РасчетОтОбратногоМенее25МРП.НомерСтроки КАК НомерСтроки,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ВидРасчета КАК Начисление,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ВидРасчета.КатегорияНачисленияИлиНеоплаченногоВремени КАК Категория,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодДействия КАК ПериодДействия,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодДействияНачало КАК ДатаНачала,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодДействияКонец КАК ДатаОкончания,
		|	ВТ_РасчетОтОбратногоМенее25МРП.БазовыйПериодНачало КАК НачалоБазовогоПериода,
		|	ВТ_РасчетОтОбратногоМенее25МРП.БазовыйПериодКонец КАК ОкончаниеБазовогоПериода,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Активность КАК Активность,
		|	ИСТИНА КАК Сторно,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Сотрудник КАК Сотрудник,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ВТ_РасчетОтОбратногоМенее25МРП.РезультатВТомЧислеЗаСчетФБ КАК РезультатВТомЧислеЗаСчетФБ,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ГрафикРаботы КАК ГрафикРаботы,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ВидУчетаВремени КАК ВидУчетаВремени,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ВремяВЧасах КАК ВремяВЧасах,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ГрафикРаботыНорма КАК ГрафикРаботыНорма,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Организация КАК Организация,
		|	ВТКадровыеДанныеСотрудников.Подразделение КАК Подразделение,
		|	ВТКадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
		|	ВТКадровыеДанныеСотрудников.Должность КАК Должность,
		|	ВТКадровыеДанныеСотрудников.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
		|	ЛОЖЬ КАК ФиксСтрока,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ФиксЗаполнение КАК ФиксЗаполнение,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ФиксРасчетВремени КАК ФиксРасчетВремени,
		|	ЛОЖЬ КАК ФиксРасчет,
		|	ИСТИНА КАК ФиксСторно,
		|	ВТ_РасчетОтОбратногоМенее25МРП.РасчетнаяБазаЗаЕдиницуНормыВремени КАК РасчетнаяБазаЗаЕдиницуНормыВремени,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодРегистрацииВремени КАК ПериодРегистрацииВремени,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодРегистрацииНормыВремени КАК ПериодРегистрацииНормыВремени,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ДоляРезультата КАК ДоляРезультата,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Месяц КАК Месяц,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ДокументОснование КАК ДокументОснование,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ГоловнойСотрудник КАК ГоловнойСотрудник,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ОбщийГрафик КАК ОбщийГрафик,
		|	-ВТ_РасчетОтОбратногоМенее25МРП.Результат КАК Результат,
		|	-ВТ_РасчетОтОбратногоМенее25МРП.ОтработаноДней КАК ОтработаноДней,
		|	-ВТ_РасчетОтОбратногоМенее25МРП.ОтработаноЧасов КАК ОтработаноЧасов
		|ИЗ
		|	ВТ_РасчетОтОбратногоМенее25МРП КАК ВТ_РасчетОтОбратногоМенее25МРП
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК ВТКадровыеДанныеСотрудников
		|		ПО ВТ_РасчетОтОбратногоМенее25МРП.Сотрудник = ВТКадровыеДанныеСотрудников.Сотрудник
		|			И ВТ_РасчетОтОбратногоМенее25МРП.ПериодДействияНачало = ВТКадровыеДанныеСотрудников.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодРегистрации,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Регистратор КАК СторнируемыйДокумент,
		|	ВТ_РасчетОтОбратногоМенее25МРП.НомерСтроки,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ВидРасчета КАК Начисление,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ВидРасчета.КатегорияНачисленияИлиНеоплаченногоВремени КАК Категория,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодДействия,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодДействияНачало,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодДействияКонец,
		|	ВТ_РасчетОтОбратногоМенее25МРП.БазовыйПериодНачало,
		|	ВТ_РасчетОтОбратногоМенее25МРП.БазовыйПериодКонец,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Активность,
		|	ЛОЖЬ КАК Сторно,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Сотрудник,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ФизическоеЛицо,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ГоловнаяОрганизация,
		|	ВТ_РасчетОтОбратногоМенее25МРП.РезультатВТомЧислеЗаСчетФБ,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ГрафикРаботы,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ВидУчетаВремени,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ВремяВЧасах,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ГрафикРаботыНорма,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Организация,
		|	ВТКадровыеДанныеСотрудников.Подразделение КАК Подразделение,
		|	ВТКадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
		|	ВТКадровыеДанныеСотрудников.Должность КАК Должность,
		|	ВТКадровыеДанныеСотрудников.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
		|	ЛОЖЬ КАК ФиксСтрока,
		|	ЛОЖЬ КАК ФиксЗаполнение,
		|	ЛОЖЬ КАК ФиксРасчетВремени,
		// если строка была вручную изменена пользователем, то при заполнении окончательного расчета будут проблемы с расчетом сумм в новых строках (будут нулевые)
		|	ЛОЖЬ КАК ФиксРасчет,
		|	ЛОЖЬ КАК ФиксСторно,
		|	ВТ_РасчетОтОбратногоМенее25МРП.РасчетнаяБазаЗаЕдиницуНормыВремени,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ИдентификаторСтроки,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодРегистрацииВремени,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодРегистрацииНормыВремени,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ДоляРезультата,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Месяц,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ДокументОснование,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ГоловнойСотрудник,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ОбщийГрафик,
		|	0 КАК Результат,
		|	0 КАК ОтработаноДней,
		|	0 КАК ОтработаноЧасов
		|ИЗ
		|	ВТ_РасчетОтОбратногоМенее25МРП КАК ВТ_РасчетОтОбратногоМенее25МРП
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК ВТКадровыеДанныеСотрудников
		|		ПО ВТ_РасчетОтОбратногоМенее25МРП.Сотрудник = ВТКадровыеДанныеСотрудников.Сотрудник
		|			И ВТ_РасчетОтОбратногоМенее25МРП.ПериодДействияНачало = ВТКадровыеДанныеСотрудников.Период
		|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПерерасчетыОтОбратного = РезультатЗапроса.Выбрать();
	
	// Сбор сведений о показателях
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СторнируемыеНачисления.Регистратор КАК Ссылка,
		|	ЗначенияПоказателейНачислений.*
		|ИЗ
		|	РегистрСведений.ЗначенияПоказателейНачислений КАК ЗначенияПоказателейНачислений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РасчетОтОбратногоМенее25МРП КАК СторнируемыеНачисления
		|		ПО ЗначенияПоказателейНачислений.РегистраторИзмерение = СторнируемыеНачисления.Регистратор
		|			И ЗначенияПоказателейНачислений.ИдентификаторСтроки = СторнируемыеНачисления.ИдентификаторСтроки";
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаПоказателей = Запрос.Выполнить().Выгрузить();
	ТаблицаПоказателей.Индексы.Добавить("Ссылка,ИдентификаторСтроки,Показатель");
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ДанныеПерерасчета.НачисленияПерерасчет.Колонки.Найти("Показатель1") = Неопределено Тогда
		ДобавитьКолонкиПоказателей(ДанныеПерерасчета.НачисленияПерерасчет);
	КонецЕсли;
	
	Если ВыборкаПерерасчетыОтОбратного.Количество() > 0 Тогда
		ЕстьНачисленияПерерасчетОтОбратного = Истина;
	КонецЕсли;
	
	// разрядность числа для того, чтобы идентифицировать строки начислений и перерасчетов
	ИдентификаторСтроки = 7000000;
	
	Пока ВыборкаПерерасчетыОтОбратного.Следующий() Цикл
		
		СтрокаПерерасчета = Обработки.МенеджерРасчетаЗарплаты.СтрокаТаблицыНачислений(ДанныеПерерасчета.НачисленияПерерасчет);
		ЗаполнитьЗначенияСвойств(СтрокаПерерасчета, ВыборкаПерерасчетыОтОбратного,, "ИдентификаторСтроки");
		
		ИдентификаторСтроки = ИдентификаторСтроки + 1;
		
		ЗаполнитьПоказатели(СтрокаПерерасчета, ТаблицаПоказателей, ВыборкаПерерасчетыОтОбратного.СторнируемыйДокумент, ВыборкаПерерасчетыОтОбратного.ИдентификаторСтроки);
		СтрокаПерерасчета.ИдентификаторСтроки = ИдентификаторСтроки;
		СтрокаПерерасчета.Показатели.ЗаполнитьЗначения(ИдентификаторСтроки, "ИдентификаторСтроки");
		
	КонецЦикла;

КонецПроцедуры

Процедура ДополнитьОписаниеПрофиляАудитор(ОписаниеПрофиля) Экспорт
	
	// Раздел НалогиВзносыОтчисления
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеПеречисленныхВзносовОтчислений");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеНезачисленныхВзносовОтчислений");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеВнешнихОперацийРасчетовПоНалогам",			"ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.НалогиВзносыОтчисленияВХО");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеВнешнихОперацийРасчетовПоВзносамИОтчислениям","ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.НалогиВзносыОтчисленияВХО");

КонецПроцедуры

Процедура ДополнитьОписаниеПрофиляРасчетчик(ОписаниеПрофиля) Экспорт
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеПеречисленныхВзносовОтчислений");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеНезачисленныхВзносовОтчислений");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеОбменаСБанками");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеВнешнихОперацийРасчетовПоНалогам",			 "ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.НалогиВзносыОтчисленияВХО");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеВнешнихОперацийРасчетовПоВзносамИОтчислениям","ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.НалогиВзносыОтчисленияВХО");

КонецПроцедуры

Функция ЭффективныеСтавкиНВОДляОценочныхОбязательств(Организация, Период, Сотрудники) Экспорт

	ОписаниеЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 4));
	
	СтавкиВзносов = Новый ТаблицаЗначений;
	СтавкиВзносов.Колонки.Добавить("Сотрудник",      Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	СтавкиВзносов.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	СтавкиВзносов.Колонки.Добавить("СтавкаСтраховыхВзносов", ОписаниеЧисло);
	СтавкиВзносов.Колонки.Добавить("СтавкаФСС_НС",  ОписаниеЧисло);
    // ЗУПК
	СтавкиВзносов.Колонки.Добавить("СтавкаСО", ОписаниеЧисло);
	СтавкиВзносов.Колонки.Добавить("СтавкаСН", ОписаниеЧисло);
	СтавкиВзносов.Колонки.Добавить("СтавкаОППВ", ОписаниеЧисло);
	СтавкиВзносов.Колонки.Добавить("СтавкаОПВР", ОписаниеЧисло);
	СтавкиВзносов.Колонки.Добавить("СтавкаОтчисленияОСМС", ОписаниеЧисло);
    // ЗУПК
	
	Если Сотрудники.Количество() = 0 Тогда
		Возврат СтавкиВзносов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадры.ГоловнаяОрганизация(Организация));
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТСотрудникиДляЗаполнения
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&Сотрудники)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	&ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|ПОМЕСТИТЬ ВТФизЛицаОрганизаций
	|ИЗ
	|	ВТСотрудникиДляЗаполнения КАК Сотрудники";
	Запрос.Выполнить();
	
	СоздатьВТЭффективныеСтавкиНВОДляОценочныхОбязательств(Запрос.МенеджерВременныхТаблиц, Организация, Период);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СотрудникиДляЗаполнения.Сотрудник КАК Сотрудник,
	|	СотрудникиДляЗаполнения.ФизическоеЛицо КАК ФизическоеЛицо,
	|	0 КАК СтавкаФСС_НС,
	|	0 КАК СтавкаСтраховыхВзносов,
	|	ЕСТЬNULL(СтавкиНВО.СтавкаСО, 0) КАК СтавкаСО,
	|	ЕСТЬNULL(СтавкиНВО.СтавкаСН, 0) КАК СтавкаСН,
	|	ЕСТЬNULL(СтавкиНВО.СтавкаОтчисленияОСМС, 0) КАК СтавкаОтчисленияОСМС,
	|	ЕСТЬNULL(СтавкиНВО.СтавкаОППВ, 0) КАК СтавкаОППВ,
	|	ЕСТЬNULL(СтавкиНВО.СтавкаОПВР, 0) КАК СтавкаОПВР
	|ИЗ
	|	ВТСотрудникиДляЗаполнения КАК СотрудникиДляЗаполнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЭффективныеСтавкиНВОДляОценочныхОбязательств КАК СтавкиНВО
	|		ПО СотрудникиДляЗаполнения.ФизическоеЛицо = СтавкиНВО.ФизическоеЛицо";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СтавкиВзносов.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.ФизическоеЛицо = Выборка.ФизическоеЛицо;
		НоваяСтрока.СтавкаСО = Выборка.СтавкаСО;
		НоваяСтрока.СтавкаСН = Выборка.СтавкаСН;
		НоваяСтрока.СтавкаОтчисленияОСМС = Выборка.СтавкаОтчисленияОСМС;
		НоваяСтрока.СтавкаОППВ = Выборка.СтавкаОППВ;
		НоваяСтрока.СтавкаОПВР = Выборка.СтавкаОПВР;
	КонецЦикла;
	
	Возврат СтавкиВзносов;

КонецФункции

Процедура СоздатьВТЭффективныеСтавкиНВОДляОценочныхОбязательств(МенеджерВременныхТаблиц, Организация, ПериодРегистрации) Экспорт

	НачалоПериода = НачалоГода(ПериодРегистрации);
	ОкончаниеПериода = КонецМесяца(ПериодРегистрации);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияОДоходах.Организация КАК Организация,
	|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СУММА(ВЫБОР
	|			КОГДА НалогообложениеНачислений.СпособОбложенияСО = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|				ТОГДА 0
	|			ИНАЧЕ СведенияОДоходах.СуммаДоходаОборот
	|		КОНЕЦ) КАК БазаСО,
	|	СУММА(ВЫБОР
	|			КОГДА НалогообложениеНачислений.СпособОбложенияСН = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|				ТОГДА 0
	|			ИНАЧЕ СведенияОДоходах.СуммаДоходаОборот
	|		КОНЕЦ) КАК БазаСН,
	|	СУММА(ВЫБОР
	|			КОГДА НалогообложениеНачислений.СпособОбложенияОППВ = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|				ТОГДА 0
	|			ИНАЧЕ СведенияОДоходах.СуммаДоходаОборот
	|		КОНЕЦ) КАК БазаОППВ,
	|	СУММА(ВЫБОР
	|			КОГДА НалогообложениеНачислений.СпособОбложенияОПВР = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|				ТОГДА 0
	|			ИНАЧЕ СведенияОДоходах.СуммаДоходаОборот
	|		КОНЕЦ) КАК БазаОПВР,
	|	СУММА(ВЫБОР
	|			КОГДА НалогообложениеНачислений.СпособОбложенияООСМС = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|				ТОГДА 0
	|			ИНАЧЕ СведенияОДоходах.СуммаДоходаОборот
	|		КОНЕЦ) КАК БазаООСМС
	|ПОМЕСТИТЬ ВТДоходыФизическихЛицПредварительно
	|ИЗ
	|	РегистрНакопления.СведенияОДоходахФизическихЛиц.Обороты(
	|			&НачалоПериода,
	|			&ОкончаниеПериода,
	|			,
	|			Организация = &Организация
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						ФизЛицаОрганизаций.ФизическоеЛицо
	|					ИЗ
	|						ВТФизЛицаОрганизаций КАК ФизЛицаОрганизаций)) КАК СведенияОДоходах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(&НачалоПериода, ) КАК НалогообложениеНачислений
	|		ПО СведенияОДоходах.Начисление = НалогообложениеНачислений.Начисление
	|			И (НалогообложениеНачислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя))
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.Организация,
	|	СведенияОДоходах.ФизическоеЛицо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияОНеоблагаемыхДоходахФизическихЛиц.Организация,
	|	СведенияОНеоблагаемыхДоходахФизическихЛиц.ФизическоеЛицо,
	|	СУММА(ВЫБОР
	|			КОГДА НалогообложениеНачислений.СпособОбложенияСО = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|				ТОГДА 0
	|			КОГДА СведенияОНеоблагаемыхДоходахФизическихЛиц.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СО)
	|				ТОГДА -СведенияОНеоблагаемыхДоходахФизическихЛиц.НеоблагаемыйДоходОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НалогообложениеНачислений.СпособОбложенияСН = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|				ТОГДА 0
	|			КОГДА СведенияОНеоблагаемыхДоходахФизическихЛиц.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СН)
	|				ТОГДА -СведенияОНеоблагаемыхДоходахФизическихЛиц.НеоблагаемыйДоходОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НалогообложениеНачислений.СпособОбложенияОППВ = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|				ТОГДА 0
	|			КОГДА СведенияОНеоблагаемыхДоходахФизическихЛиц.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОППВ)
	|				ТОГДА -СведенияОНеоблагаемыхДоходахФизическихЛиц.НеоблагаемыйДоходОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НалогообложениеНачислений.СпособОбложенияОПВР = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|				ТОГДА 0
	|			КОГДА СведенияОНеоблагаемыхДоходахФизическихЛиц.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВР)
	|				ТОГДА -СведенияОНеоблагаемыхДоходахФизическихЛиц.НеоблагаемыйДоходОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НалогообложениеНачислений.СпособОбложенияООСМС = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|				ТОГДА 0
	|			КОГДА СведенияОНеоблагаемыхДоходахФизическихЛиц.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ООСМС)
	|				ТОГДА -СведенияОНеоблагаемыхДоходахФизическихЛиц.НеоблагаемыйДоходОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.СведенияОНеоблагаемыхДоходахФизическихЛиц.Обороты(
	|			&НачалоПериода,
	|			&ОкончаниеПериода,
	|			,
	|			Организация = &Организация
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						ФизЛицаОрганизаций.ФизическоеЛицо
	|					ИЗ
	|						ВТФизЛицаОрганизаций КАК ФизЛицаОрганизаций)) КАК СведенияОНеоблагаемыхДоходахФизическихЛиц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(&НачалоПериода, ) КАК НалогообложениеНачислений
	|		ПО СведенияОНеоблагаемыхДоходахФизическихЛиц.Начисление = НалогообложениеНачислений.Начисление
	|			И (НалогообложениеНачислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя))
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОНеоблагаемыхДоходахФизическихЛиц.Организация,
	|	СведенияОНеоблагаемыхДоходахФизическихЛиц.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтраховыеВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СУММА(СтраховыеВзносы.СО) КАК СО,
	|	СУММА(СтраховыеВзносы.СН) КАК СН,
	|	СУММА(СтраховыеВзносы.ОППВ) КАК ОППВ,
	|	СУММА(СтраховыеВзносы.ОПВР) КАК ОПВР,
	|	СУММА(СтраховыеВзносы.ООСМС) КАК ООСМС
	|ПОМЕСТИТЬ ВТВзносыФизическихЛиц
	|ИЗ
	|	РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам КАК СтраховыеВзносы
	|ГДЕ
	|	СтраховыеВзносы.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ФизическиеЛица.ФизическоеЛицо
	|			ИЗ
	|				ВТФизЛицаОрганизаций КАК ФизическиеЛица)
	|	И СтраховыеВзносы.Организация = &Организация
	|	И СтраховыеВзносы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
	|	И СтраховыеВзносы.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносы.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СУММА(СведенияОДоходах.БазаСО) КАК БазаСО,
	|	СУММА(СведенияОДоходах.БазаСН) КАК БазаСН,
	|	СУММА(СведенияОДоходах.БазаОППВ) КАК БазаОППВ,
	|	СУММА(СведенияОДоходах.БазаОПВР) КАК БазаОПВР,
	|	СУММА(СведенияОДоходах.БазаООСМС) КАК БазаООСМС
	|ПОМЕСТИТЬ ВТДоходыФизическихЛиц
	|ИЗ
	|	ВТДоходыФизическихЛицПредварительно КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
    //Не учитываем погрешности округления Базы налогов, взносов и отчислений 
    |ВЫБРАТЬ
	|	Взносы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА Взносы.СО > 0
	|				И Доходы.БазаСО >= 1
	|			ТОГДА ВЫРАЗИТЬ(100 * Взносы.СО / Доходы.БазаСО КАК ЧИСЛО(15, 4))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаСО,
	|	ВЫБОР
	|		КОГДА Взносы.СН > 0
	|				И Доходы.БазаСН >= 1
	|			ТОГДА ВЫРАЗИТЬ(100 * Взносы.СН / Доходы.БазаСН КАК ЧИСЛО(15, 4))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаСН,
	|	ВЫБОР
	|		КОГДА Взносы.ОППВ > 0
	|				И Доходы.БазаОППВ >= 1
	|			ТОГДА ВЫРАЗИТЬ(100 * Взносы.ОППВ / Доходы.БазаОППВ КАК ЧИСЛО(15, 4))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаОППВ,
	|	ВЫБОР
	|		КОГДА Взносы.ОПВР > 0
	|				И Доходы.БазаОПВР >= 1
	|			ТОГДА ВЫРАЗИТЬ(100 * Взносы.ОПВР / Доходы.БазаОПВР КАК ЧИСЛО(15, 4))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаОПВР,
	|	ВЫБОР
	|		КОГДА Взносы.ООСМС > 0
	|				И Доходы.БазаООСМС >= 1
	|			ТОГДА ВЫРАЗИТЬ(100 * Взносы.ООСМС / Доходы.БазаООСМС КАК ЧИСЛО(15, 4))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтавкаОтчисленияОСМС
	|ПОМЕСТИТЬ ВТЭффективныеСтавкиНВОДляОценочныхОбязательств
	|ИЗ
	|	ВТВзносыФизическихЛиц КАК Взносы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоходыФизическихЛиц КАК Доходы
	|		ПО Взносы.ФизическоеЛицо = Доходы.ФизическоеЛицо;
	|";
	Запрос.Выполнить();

КонецПроцедуры

// Выводит в коллекцию печатных форм табличный документ настраиваемой печатной формы.
// Используется при формировании настраиваемых печатных форм из модулей менеджеров отчетов - печатных форм.
//
// Параметры:
//   ИмяОтчета                           - Строка, полное имя объекта метаданных - отчета
//   МассивОбъектов                      - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//   ПараметрыПечати                     - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//   КоллекцияПечатныхФорм               - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//   ОбъектыПечати                       - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//   ПараметрыВывода                     - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//   ВнешниеНаборыДанных                 - Структура
//   ДополнительныеПараметрыФормирования - Структура
//
Процедура ВывестиВКоллекциюВнешнююПечатнуюФорму(ИмяОтчета, МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, ВнешниеНаборыДанных = Неопределено, ДополнительныеПараметрыФормирования = Неопределено, МакетПечатнойФормы, ФорматДатНаКазахскомЯзыке = Ложь, РеквизитыЗаполненияДатНаКазахскомЯзыке = Неопределено) Экспорт
	
	ВариантыОтчетовПечатныхФорм = ЗарплатаКадрыОтчеты.МакетыВариантовОтчетовПечатныхФорм();
	Для Каждого ОписаниеНастраиваемойФормы Из ВариантыОтчетовПечатныхФорм Цикл
		
		ПутьКВариантуОтчета = ОписаниеНастраиваемойФормы.Ключ;
		Если СтрНайти(ПутьКВариантуОтчета, ИмяОтчета) = 1 Тогда
			
			ПутьКМакетуПечатнойФормы = ОписаниеНастраиваемойФормы.Значение;
			ИмяМакетаПечатнойФормы = ЗарплатаКадрыОтчеты.ИмяМакетаИзПутиКМакетуПечатнойФормы(ПутьКМакетуПечатнойФормы);
			
			Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакетаПечатнойФормы) Тогда
				
				Если ДополнительныеПараметрыФормирования = Неопределено Тогда
					ДополнительныеПараметры = Новый Структура;
				Иначе
					ДополнительныеПараметры = ОбщегоНазначения.СкопироватьРекурсивно(ДополнительныеПараметрыФормирования);
				КонецЕсли;
				
				ДокументРезультат = Новый ТабличныйДокумент;
				
				КлючВарианта = ЗарплатаКадрыОтчеты.КлючВариантаИзПутиКВарианту(ПутьКВариантуОтчета);
				
				Если ВРег(Лев(ПутьКМакетуПечатнойФормы, 11)) = ВРег("ОбщийМакет.") Тогда
					ПредставлениеПечатнойФормы = Метаданные.ОбщиеМакеты[ИмяМакетаПечатнойФормы].Синоним;
				Иначе
					ПредставлениеПечатнойФормы = Метаданные.НайтиПоПолномуИмени(ИмяОтчета).Макеты[ИмяМакетаПечатнойФормы].Синоним;
				КонецЕсли;
				
				МассивСловИмениОтчета = СтрРазделить(ИмяОтчета, ".");
				ОбъектОтчета = Отчеты[МассивСловИмениОтчета[1]].Создать();
				
				Если ДополнительныеПараметры.Свойство("Отбор") Тогда
					МакетКомпоновкиДанных = Неопределено;
				Иначе
					МакетКомпоновкиДанных = ЗарплатаКадрыОтчеты.МакетКомпоновкиДанныхОтчетаПоКлючуВарианта(ОбъектОтчета, КлючВарианта);
				КонецЕсли;
				
				Если МакетКомпоновкиДанных = Неопределено Тогда
					
					НастройкиОтчетаКД = Неопределено;
					ПользовательскиеНастройкиКД = Неопределено;
					
					ЗарплатаКадрыОтчеты.ИнициализироватьНастройкиОтчета(ОбъектОтчета, "", КлючВарианта, НастройкиОтчетаКД, ПользовательскиеНастройкиКД);
					
					Если НастройкиОтчетаКД = Неопределено Тогда
						НастройкиОтчетаКД = ОбъектОтчета.СхемаКомпоновкиДанных.ВариантыНастроек[КлючВарианта].Настройки;
					КонецЕсли;
					
					ОбъектОтчета.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчетаКД);
					Если ТипЗнч(ПользовательскиеНастройкиКД) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
						ОбъектОтчета.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройкиКД);
					КонецЕсли;
					
					ЗарплатаКадрыОтчеты.УстановитьПараметрОтбора(ОбъектОтчета, МассивОбъектов);
					
				Иначе
					
					ОбъектОтчета.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить(
						"МакетКомпоновкиДанных", МакетКомпоновкиДанных);
					
					ПараметрКлючВарианта = МакетКомпоновкиДанных.ЗначенияПараметров.Найти("КлючВарианта");
					Если ПараметрКлючВарианта <> Неопределено Тогда
						ДополнительныеПараметры.Вставить("КлючВарианта", ПараметрКлючВарианта.Значение);
					КонецЕсли;
					
					Для каждого Параметр Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
						
						ПараметрКомпоновщика = Лев(Параметр.Имя, 1) = "П" И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Сред(Параметр.Имя, 2));
						
						Если Параметр.Имя = "СсылкиНаОбъекты"
							Или ПараметрКомпоновщика
								И ТипЗнч(Параметр.Значение) = Тип("СписокЗначений")
								И Не ЗначениеЗаполнено(Параметр.Значение) Тогда
							
							Параметр.Значение.ЗагрузитьЗначения(МассивОбъектов);
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				Если ФорматДатНаКазахскомЯзыке Тогда
					ЗаменитьФорматДатНаКазахскийЯзык(ОбъектОтчета);
				КонецЕсли;
				РезультатКомпоновки = ЗарплатаКадрыОтчеты.РезультатКомпоновкиМакетаПечатнойФормы(ОбъектОтчета, , , ВнешниеНаборыДанных, ДополнительныеПараметры);
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РезультатКомпоновки, "МакетПечатнойФормы") Тогда
					РезультатКомпоновки.МакетПечатнойФормы = МакетПечатнойФормы;
				КонецЕсли;
				
				МенеджерОтчета = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяОтчета);
				МенеджерОтчета.Сформировать(ДокументРезультат, РезультатКомпоновки, ОбъектыПечати, ПараметрыПечати);
				
				Если РеквизитыЗаполненияДатНаКазахскомЯзыке <> Неопределено Тогда
					ЗаполняемыеРеквизиты = РеквизитыЗаполненияДатНаКазахскомЯзыке.Получить("ЗаполняемыеРеквизиты");
					Если Найти(ЗаполняемыеРеквизиты, "ПолныйПериодОтпуска") > 0 Тогда
						ЗаполнитьПолныйПериодОтпускаНаКазахскомЯзыке(РезультатКомпоновки, ДокументРезультат, РеквизитыЗаполненияДатНаКазахскомЯзыке);
					КонецЕсли;
				КонецЕсли;
				
				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
					КоллекцияПечатныхФорм,
					ИмяМакетаПечатнойФормы,
					ПредставлениеПечатнойФормы,
					ДокументРезультат,,);
				
				Прервать;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ФорматДатыЧислоВКавычкахМесяцПрописьюНаКазахскомЯзыке(Знач ФорматируемаяДата, ВыводитьШаблонПустойДаты = Истина) Экспорт
	
	Если ФорматируемаяДата = NULL Тогда
		ФорматируемаяДата = '00010101';
	КонецЕсли;
	
	СтрокаФормата = "Л=kk; ДФ='''""''дд''""'' ММММ гггг ''ж.'''";
	Если ВыводитьШаблонПустойДаты Тогда
		СтрокаФормата = СтрокаФормата + "; ДП='""___"" ______________ 20____ ж.'";
	КонецЕсли;
	
	Возврат СтрЗаменить(Формат(ФорматируемаяДата, СтрокаФормата), " ", Символы.НПП);
	
КонецФункции

Процедура СкорректироватьВремяРегистрацииДокументаКоэффициентыИндексации(КоэффициентИндексацииЗаработка) Экспорт

	Если ТипЗнч(КоэффициентИндексацииЗаработка) = Тип("РегистрСведенийНаборЗаписей.КоэффициентИндексацииЗаработка") Тогда
		
		Если КоэффициентИндексацииЗаработка.ДополнительныеСвойства.Свойство("ВремяРегистрацииДокумента") Тогда
			
			ВремяРегистрацииДокумента = КоэффициентИндексацииЗаработка.ДополнительныеСвойства.ВремяРегистрацииДокумента;
			
			Для Каждого СтрокаРегистрации Из ВремяРегистрацииДокумента Цикл
				
				ДанныеНаДату = СтрокаРегистрации.Значение;
				
				Если НЕ НачалоМесяца(СтрокаРегистрации.Ключ) = СтрокаРегистрации.Ключ Тогда
					
					НачалоМесяцаСобытия = ВремяРегистрацииДокумента.Получить(НачалоМесяца(СтрокаРегистрации.Ключ));
					
					Для Каждого ДанныеСотрудника Из ДанныеНаДату Цикл
						
						ДатаНачалаПериода = ДанныеСотрудника.Значение - (НачалоДня(ДанныеСотрудника.Значение) - НачалоМесяца(ДанныеСотрудника.Значение));
						Если НачалоМесяцаСобытия = Неопределено Тогда
							ВремяРегистрацииДокумента.Вставить(ДанныеСотрудника.Ключ, НачалоМесяца(СтрокаРегистрации.Ключ));	
						Иначе
							НачалоМесяцаСобытия.Вставить(ДанныеСотрудника.Ключ, ДатаНачалаПериода);
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСвойстваФактическогоПлательщика(Элемент, Организация, ФактическийПлательщик = Неопределено) Экспорт
	
	ЗначенияВыбора = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.ГоловнаяОрганизация КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|	И Организации.ОбособленноеПодразделение = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Организация КАК Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ГоловнаяОрганизация = &Организация
		|	И Организации.ОбособленноеПодразделение = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Владелец = &Организация
		|	И ПодразделенияОрганизаций.ОбособленноеПодразделение = ИСТИНА";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗначенияВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(ЗначенияВыбора);
	
	ЕстьНесколькоВариантовВыбора = ЗначенияВыбора.Количество() > 1;
	Элемент.Видимость = ЕстьНесколькоВариантовВыбора И ИспользоватьФорматMX();
	
	Если ФактическийПлательщик <> Неопределено Тогда
		// очистка значения при смене организации
		ФактическийПлательщик = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Функция ИспользоватьФорматMX() Экспорт
	
	Возврат Истина;
	
КонецФункции

// См. МенеджерРасчетаЗарплаты.РазбитьСтрокиВидовРасчетаПоМесяца
Процедура РазбитьСтрокиВидовРасчетаПоМесяцам(ТаблицаВидовРасчетов) Экспорт
	ИндексТекущейСтроки = 0;
	Пока ИндексТекущейСтроки < ТаблицаВидовРасчетов.Количество()  Цикл
		СтрокаТаблицы = ТаблицаВидовРасчетов[ИндексТекущейСтроки];
		Если НачалоМесяца(СтрокаТаблицы.ДатаНачала) = НачалоМесяца(СтрокаТаблицы.ДатаОкончания) Тогда
			ИндексТекущейСтроки = ИндексТекущейСтроки + 1;
			Продолжить;
		КонецЕсли;
		
		ТекущийМесяц = ДобавитьМесяц(НачалоМесяца(СтрокаТаблицы.ДатаНачала), 1);
		ПоследнийМесяц = НачалоМесяца(СтрокаТаблицы.ДатаОкончания);
		
		ИсходнаяДатаОкончания = СтрокаТаблицы.ДатаОкончания;
		Пока ТекущийМесяц <= ПоследнийМесяц Цикл
			СтрокаТаблицы.ДатаОкончания = КонецМесяца(СтрокаТаблицы.ДатаНачала);	
			
			ИндексТекущейСтроки = ИндексТекущейСтроки + 1;
			НоваяСтрока = ВставитьСтрокуВТаблицу(ТаблицаВидовРасчетов, ИндексТекущейСтроки, СтрокаТаблицы);
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы, "Дополнительно")
				И ТипЗнч(СтрокаТаблицы.Дополнительно) = Тип("Структура") Тогда
				НоваяСтрока.Дополнительно = ОбщегоНазначения.СкопироватьРекурсивно(СтрокаТаблицы.Дополнительно);
			КонецЕсли;
			НоваяСтрока.ДатаНачала = ТекущийМесяц;
			НоваяСтрока.ДатаОкончания = Мин(ИсходнаяДатаОкончания, КонецМесяца(ТекущийМесяц));
			
			ТекущийМесяц = ДобавитьМесяц(ТекущийМесяц, 1);
		КонецЦикла;	
		
		ИндексТекущейСтроки = ИндексТекущейСтроки + 1;
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКолонкиПоказателей(Таблица)
	
	Для Счетчик = 1 По ЗарплатаКадрыРасширенныйПовтИсп.МаксимальноеКоличествоПоказателейИспользуемыхПриРасчете() Цикл
		Таблица.Колонки.Добавить("Показатель" + Счетчик);
		Таблица.Колонки.Добавить("Значение" + Счетчик, Справочники.ПоказателиРасчетаЗарплаты.ОписаниеТиповЗначенияПоказателяРасчетаЗарплаты());
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоказатели(СтрокаСторноПерерасчет, ТаблицаПоказателей, Ссылка, ИдентификаторСтрокиВидаРасчета)
	
	НомерПоказателя = 1;
	ИнформацияОНачислении = ЗарплатаКадрыРасширенныйПовтИсп.ПолучитьИнформациюОВидеРасчета(СтрокаСторноПерерасчет.Начисление);
	Для каждого ОписаниеПоказателя Из ИнформацияОНачислении.Показатели Цикл
		
		СтруктураПоиска = Новый Структура("Ссылка,ИдентификаторСтроки,Показатель", Ссылка, ИдентификаторСтрокиВидаРасчета, ОписаниеПоказателя.Показатель);
		СтрокиПоказателей = ТаблицаПоказателей.НайтиСтроки(СтруктураПоиска);
		Если СтрокиПоказателей.Количество() > 0  Тогда
			
			НоваяСтрока = СтрокаСторноПерерасчет.Показатели.Добавить();
			НоваяСтрока.Показатель = ОписаниеПоказателя.Показатель;
			НоваяСтрока.Значение = СтрокиПоказателей[0].Значение;
			НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтрокиВидаРасчета;
			
			СтрокаСторноПерерасчет["Показатель" + НомерПоказателя] = ОписаниеПоказателя.Показатель;
			СтрокаСторноПерерасчет["Значение" + НомерПоказателя] = СтрокиПоказателей[0].Значение;
			
		КонецЕсли;
		
		НомерПоказателя = НомерПоказателя + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаменитьФорматДатНаКазахскийЯзык(ОбъектОтчета)
	
	ДополнительныеСвойства = ОбъектОтчета.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДополнительныеСвойства, "МакетКомпоновкиДанных") Тогда
		МакетКомпоновкиДанных = ДополнительныеСвойства.МакетКомпоновкиДанных;
		Для Каждого Макет Из МакетКомпоновкиДанных.Макеты Цикл
			Для Каждого Параметр Из Макет.Параметры Цикл
				Если Найти(Параметр.Выражение, "ЗарплатаКадрыОтчеты.ФорматДатыЧислоВКавычкахМесяцПрописью") > 0 Тогда
					Параметр.Выражение = СтрЗаменить(Параметр.Выражение, "ЗарплатаКадрыОтчеты.ФорматДатыЧислоВКавычкахМесяцПрописью", "ЗарплатаКадрыРасширенныйРК.ФорматДатыЧислоВКавычкахМесяцПрописьюНаКазахскомЯзыке");
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПолныйПериодОтпускаНаКазахскомЯзыке(РезультатКомпоновки, ДокументРезультат, РеквизитыЗаполненияДат)
	
	ДатаНачалаВсегоРеквизит = РеквизитыЗаполненияДат.Получить("ДатаНачалаВсего");
	ДатаОкончанияВсегоРеквизит = РеквизитыЗаполненияДат.Получить("ДатаОкончанияВсего");
	
	Для Каждого ДанныеСотрудников Из РезультатКомпоновки.ДанныеОтчета.Строки Цикл
		Для Каждого ДанныеНаПечать Из ДанныеСотрудников.Строки Цикл
			ДатаНачалаВсего = ?(ЗначениеЗаполнено(ДанныеНаПечать.СсылкаНаОбъектДатаНачалаОсновногоОтпуска), ДанныеНаПечать.СсылкаНаОбъектДатаНачалаОсновногоОтпуска, '00010101');
			Если Не ЗначениеЗаполнено(ДатаНачалаВсего) 
				И ДанныеНаПечать.СсылкаНаОбъектДанныеОтпусковОсновной = Истина
				И ЗначениеЗаполнено(ДанныеНаПечать.СсылкаНаОбъектДанныеОтпусковДатаНачала) Тогда 
				ДатаНачалаВсего = ДанныеНаПечать.СсылкаНаОбъектДанныеОтпусковДатаНачала;
			КонецЕсли;
			
			ДатаОкончанияВсего = ?(ЗначениеЗаполнено(ДанныеНаПечать.СсылкаНаОбъектДатаОкончанияОсновногоОтпуска), ДанныеНаПечать.СсылкаНаОбъектДатаОкончанияОсновногоОтпуска, '00010101');
			Если Не ЗначениеЗаполнено(ДатаОкончанияВсего) 
				И ДанныеНаПечать.СсылкаНаОбъектДанныеОтпусковОсновной = Истина
				И ЗначениеЗаполнено(ДанныеНаПечать.СсылкаНаОбъектДанныеОтпусковДатаОкончания) Тогда 
				ДатаОкончанияВсего = ДанныеНаПечать.СсылкаНаОбъектДанныеОтпусковДатаОкончания;
			КонецЕсли;
			
			Для Каждого ДанныеДетальныхЗаписей Из ДанныеНаПечать.Строки Цикл
				
				Если Не ЗначениеЗаполнено(ДатаНачалаВсего)
					Или ЗначениеЗаполнено(ДанныеДетальныхЗаписей.СсылкаНаОбъектДанныеОтпусковДатаНачала)
						И ДатаНачалаВсего > ДанныеДетальныхЗаписей.СсылкаНаОбъектДанныеОтпусковДатаНачала Тогда
					
					ДатаНачалаВсего = ДанныеДетальныхЗаписей.СсылкаНаОбъектДанныеОтпусковДатаНачала;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ДанныеДетальныхЗаписей.СсылкаНаОбъектДанныеОтпусковДатаОкончания)
						И ДатаОкончанияВсего < ДанныеДетальныхЗаписей.СсылкаНаОбъектДанныеОтпусковДатаОкончания Тогда
					
					ДатаОкончанияВсего = ДанныеДетальныхЗаписей.СсылкаНаОбъектДанныеОтпусковДатаОкончания;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ДокументРезультат.Область(ДатаНачалаВсегоРеквизит).Текст = ЗарплатаКадрыРасширенныйРК.ФорматДатыЧислоВКавычкахМесяцПрописьюНаКазахскомЯзыке(ДатаНачалаВсего);
			ДокументРезультат.Область(ДатаОкончанияВсегоРеквизит).Текст = ЗарплатаКадрыРасширенныйРК.ФорматДатыЧислоВКавычкахМесяцПрописьюНаКазахскомЯзыке(ДатаОкончанияВсего);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ВставитьСтрокуВТаблицу(Таблица, ИндексСтроки = Неопределено, ШаблонЗаполнения = Неопределено)
	Если ИндексСтроки = Неопределено 
		Или ИндексСтроки > Таблица.Количество() - 1 Тогда
		
		НоваяСтрока = Таблица.Добавить();		
	Иначе
		НоваяСтрока = Таблица.Вставить(ИндексСтроки);
	КонецЕсли;
	
	Если ШаблонЗаполнения <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ШаблонЗаполнения);
	КонецЕсли;
	
	Возврат НоваяСтрока;
КонецФункции

#КонецОбласти
